## Online Sales Data

### Create SQLite database 'online_sales.db'

Here I created a SQLite database using the <a href="https://www.kaggle.com/datasets/shreyanshverma27/online-sales-dataset-popular-marketplace-data">Online Sales Dataset</a>
from <a href='https://www.kaggle.com/'>Kaggle</a>. For creating the database it is used the SQLite3 module in Python. 

Then data was retrieved from the database in a Pandas dataframe. It will be used further for Exploratory Data Analysis.

In [ ]:
# Importing libraries
import sqlite3
import csv

In [2]:
# Open csv file/read data/extract data 
with open('Online Sales Data.csv', 'r') as file_obj:           
    reader_obj = csv.DictReader(file_obj)           
    sales_info = [(i['Transaction_ID'], i['Date'], i['Product_Category'], i['Product_Name'], i['Units_Sold'], i['Unit_Price'],
               i['Total_Revenue'], i['Region'], i['Payment_Method']) for i in reader_obj]

# Create the connection object
conn = sqlite3.connect('online_sales.db')

# Create cursor object
c = conn.cursor()

# Create 'sales' table
c.execute('''CREATE TABLE sales (Transaction_ID int, Date text, Product_Category text, Product_Name text, 
                                Units_Sold int, Unit_Price real, Total_Revenue real, Region text, 
                                Payment_Method text);''')  

# Insert values into the table from the csv file
c.executemany('''
                INSERT INTO sales ('Transaction_ID', 'Date', 'Product_Category', 'Product_Name',
                                 'Units_Sold', 'Unit_Price', 'Total_Revenue', 'Region', 'Payment_Method') 
                VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?);''', sales_info)

# Commit data
conn.commit() 

# Query db
sql_query = pd.read_sql_query ('''SELECT * FROM sales''', conn)        

# Create Pandas dataframe
sales_data = pd.DataFrame(sql_query, columns = ['Transaction_ID', 'Date', 'Product_Category', 'Product_Name',
                                            'Units_Sold', 'Unit_Price', 'Total_Revenue', 'Region', 'Payment_Method'])

# Display data
print (sales_data.shape)
print(sales_data.head())

# Close db connection
conn.close()

(240, 9)
   Transaction_ID      Date Product_Category             Product_Name  \
0           10001  1/1/2024      Electronics            iPhone 14 Pro
1           10002  1/2/2024  Home Appliances         Dyson V11 Vacuum
2           10003  1/3/2024         Clothing         Levi's 501 Jeans
3           10004  1/4/2024            Books        The Da Vinci Code
4           10005  1/5/2024  Beauty Products  Neutrogena Skincare Set

   Units_Sold  Unit_Price  Total_Revenue         Region Payment_Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

In [3]:
# Print shape and first rows from Pandas dataframe
print(sales_data.shape)
sales_data.head()

(240, 9)

,Transaction_ID,Date,Product_Category,Product_Name,Units_Sold,Unit_Price,Total_Revenue,Region,Payment_Method
0,10001,1/1/2024,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,1/2/2024,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,1/3/2024,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,1/4/2024,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,1/5/2024,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal